Public Member Functions | Protected Member Functions | List of all members
ACAPI::MEP::v1::PortDefaultBase Class Reference
MEP Element Manager
Through this PortDefault you can access and configure the Ports of MEPElementDefaults before placement. More...
#include <MEPPortDefaultBase.hpp>
 Inheritance diagram for ACAPI::MEP::v1::PortDefaultBase:
 Public Member Functions
GS::UniString  | GetName () const
double  | GetWidth () const
ConnectorShape  | GetShape () const
API_AttributeIndex  | GetMEPSystem () const
Domain  | GetDomain () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
void  | SetWidth (double width)
Sets the width of the port.
void  | SetShape (ConnectorShape shape)
Sets the shape of the port.
void  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of a Port.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
PortDefaultBase (std::shared_ptr< Impl::IPortDefaultBaseImpl > impl)
Constructs a PortBase with the given PortDefaultBase implementation.
Modifier (PortDefaultBase &parent)
Constructs a Modifier with the given PortDefaultBase parent.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Through this PortDefault you can access and configure the Ports of MEPElementDefaults before placement.
Since
Archicad 28
Example code snippet from Test / New MEP
Getters
void WriteElementDefaultDetails (const ElementDefault& mepElemDefault)
{
 Reporter elementDefaultReporter;
 elementDefaultReporter.Add ("Domain of default", mepElemDefault.GetDomain ());
 uint32_t portCount = mepElemDefault.GetPortCount ();
 for (uint32_t portIdx = 0; portIdx < portCount; portIdx++) {
 elementDefaultReporter.SetTabCount (1);
 ACAPI::Result<VentilationPortDefault> ventilationPortDefault = mepElemDefault.GetVentilationPortDefault (portIdx);
 if (ventilationPortDefault.IsOk ()) {
 elementDefaultReporter.Add ("Port name", ventilationPortDefault->GetName ());
 elementDefaultReporter.SetTabCount (2);
 elementDefaultReporter.Add ("Domain", ventilationPortDefault->GetDomain ());
 elementDefaultReporter.Add ("Width", ventilationPortDefault->GetWidth ());
 elementDefaultReporter.Add ("Height", ventilationPortDefault->GetHeight ());
 elementDefaultReporter.Add ("Shape", ventilationPortDefault->GetShape ());
 elementDefaultReporter.Add ("MEPSystem", ventilationPortDefault->GetMEPSystem ());
 elementDefaultReporter.Add ("WallThickness", ventilationPortDefault->GetWallThickness ());
 elementDefaultReporter.Add ("FlowDirection", ventilationPortDefault->GetFlowDirection ());
 } else {
 ACAPI::Result<PipingPortDefault> pipingPortDefault = mepElemDefault.GetPipingPortDefault (portIdx);
 if (pipingPortDefault.IsOk ()) {
 elementDefaultReporter.Add ("Port name", pipingPortDefault->GetName ());
 elementDefaultReporter.SetTabCount (2);
 elementDefaultReporter.Add ("Domain", pipingPortDefault->GetDomain ());
 elementDefaultReporter.Add ("Diameter", pipingPortDefault->GetDiameter ());
 elementDefaultReporter.Add ("Shape", pipingPortDefault->GetShape ());
 elementDefaultReporter.Add ("MEPSystem", pipingPortDefault->GetMEPSystem ());
 elementDefaultReporter.Add ("WallThickness", pipingPortDefault->GetWallThickness ());
 elementDefaultReporter.Add ("FlowDirection", pipingPortDefault->GetFlowDirection ());
 } else {
 ACAPI::Result<CableCarrierPortDefault> cableCarrierPortDefault = mepElemDefault.GetCableCarrierPortDefault (portIdx);
 if (cableCarrierPortDefault.IsOk ()) {
 elementDefaultReporter.Add ("Port name", cableCarrierPortDefault->GetName ());
 elementDefaultReporter.SetTabCount (2);
 elementDefaultReporter.Add ("Domain", cableCarrierPortDefault->GetDomain ());
 elementDefaultReporter.Add ("Width", cableCarrierPortDefault->GetWidth ());
 elementDefaultReporter.Add ("Height", cableCarrierPortDefault->GetHeight ());
 elementDefaultReporter.Add ("Shape", cableCarrierPortDefault->GetShape ());
 elementDefaultReporter.Add ("MEPSystem", cableCarrierPortDefault->GetMEPSystem ());
 }
 }
 }
 }
 elementDefaultReporter.SetTabCount (0);
 std::optional<double> insulation = mepElemDefault.GetInsulationThickness ();
 insulation.has_value () ? elementDefaultReporter.Add ("Insulation thickness", *insulation) : elementDefaultReporter.Add ("Has no insulation");
 elementDefaultReporter.Write ();
}
Constructor & Destructor Documentation
◆ PortDefaultBase()
 ACAPI::MEP::v1::PortDefaultBase::PortDefaultBase  |  ( |  std::shared_ptr< Impl::IPortDefaultBaseImpl >  |  impl | )
protected
Constructs a PortBase with the given PortDefaultBase implementation.
Parameters
impl | The PortDefaultBase implementation.
Member Function Documentation
◆ GetDomain()
 Domain ACAPI::MEP::v1::PortDefaultBase::GetDomain  |  ( |   | ) |   const
The domain of the Port can differ from the domain of the element that it belongs to, for ex. in case of Equipments.
Returns
Returns the domain of the Port.
◆ GetMEPSystem()
 API_AttributeIndex ACAPI::MEP::v1::PortDefaultBase::GetMEPSystem  |  ( |   | ) |   const
Returns
Returns the AttributeIndex of the MEPSystem attribute to which it belongs.
◆ GetName()
 GS::UniString ACAPI::MEP::v1::PortDefaultBase::GetName  |  ( |   | ) |   const
Returns
Returns the name of the Port which you would see on the user interface.
◆ GetShape()
 ConnectorShape ACAPI::MEP::v1::PortDefaultBase::GetShape  |  ( |   | ) |   const
Returns
Returns the shape of the Port.
◆ GetWidth()
 double ACAPI::MEP::v1::PortDefaultBase::GetWidth  |  ( |   | ) |   const
Returns
Returns the width of the Port.
◆ Modifier()
 ACAPI::MEP::v1::PortDefaultBase::Modifier  |  ( |  PortDefaultBase &  |  parent | )
protected
Constructs a Modifier with the given PortDefaultBase parent.
Parameters
parent | The parent PortDefaultBase.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::PortDefaultBase::Modify  |  ( |  ModifierFunc &&  |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetMEPSystem()
 void ACAPI::MEP::v1::PortDefaultBase::SetMEPSystem  |  ( |  const API_AttributeIndex &  |  attributeIndex | )
Sets the MEPSystem attribute of a Port.
Parameters
attributeIndex | The MEPSystem AttributeIndex to be set.
◆ SetShape()
 void ACAPI::MEP::v1::PortDefaultBase::SetShape  |  ( |  ConnectorShape  |  shape | )
Sets the shape of the port.
Parameters
shape | The shape to be set.
◆ SetWidth()
 void ACAPI::MEP::v1::PortDefaultBase::SetWidth  |  ( |  double  |  width | )
Sets the width of the port.
Parameters
width | The value to be set.